[
    {
        "type": "message",
        "text": "еще один список курсов: <http:\/\/advanceddataanalytics.net\/courses\/>",
        "user": "U040M0W0S",
        "ts": "1443366607.000108",
        "team": "T040HKJE3",
        "user_team": "T040HKJE3",
        "source_team": "T040HKJE3",
        "user_profile": {
            "avatar_hash": "gf94d3badfe5",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/0bf94d3badfe56d3a3f556d132479557.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0002-72.png",
            "first_name": "i",
            "real_name": "i",
            "display_name": "i",
            "team": "T040HKJE3",
            "name": "i",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "service_name": "Data Analytics &amp; R",
                "service_url": "http:\/\/advanceddataanalytics.net",
                "title": "Courses",
                "title_link": "http:\/\/advanceddataanalytics.net\/courses\/",
                "author_name": "Michael Laux",
                "author_link": "https:\/\/advanceddataanalytics.net\/author\/aboutdataanalytics\/",
                "thumb_url": "https:\/\/i1.wp.com\/aboutdataanalytics.files.wordpress.com\/2015\/04\/link.png?fit=200%2C150",
                "thumb_width": 9,
                "thumb_height": 9,
                "text": "5 | A | B | C | D | E | F | G | H | I | K | L | M | N | O | P | R | S | T | U | W\n\n\n|Courses| = 134\n\n\nCourseBuffet\nAt CourseBuffet we personally examine and classify every course we list. This means you find courses faster and can compare them more easily. Spend your time learning not searching.\n https:\/\/…\/search?q=Machine+Learning\n https:\/\/…\/search?q=Data+Science\n https:\/\/…\/search?q=Data+Mining\n https:\/\/…\/search?q=Big+Data\n https:\/\/…\/search?q=Statistics\n\n\n\n5\n\n\n\n5 Minutes With Ingo(RapidMiner)\nSpend 5 minutes with Dr. Ingo Mierswa, CEO, co-founder and data scientist in residence, at RapidMiner. In this series, Ingo shares his thoughts about trends, challenges and opportunities in analytics and also breaks down complex data science concepts into understandable segments. Plus, Ingo has some fun with his friend Data Scientist Number 7, Whiteboard Number 2, Marla Mierswa – RapidMiner’s Chief Furry Officer, and a series of other special guests and RapidMiners.\n\n\n\nA\n\n\n\nA Hands-on Introduction to Statistics with R(Datacamp)\nThis selection of courses is designed to be a comprehensive yet friendly introduction to fundamental concepts in statistics. The focus is on statistics but you will make use of the statistical programming language R. For those new to R, an introduction to the R programming language is provided. This course is, quite literally, for everyone. Whether you’re new to statistics, need a refresher course, or a relatively advanced researcher or analyst.\n\n\nA\/B Testing(Udacity)\nThis course will cover the design and analysis of A\/B tests, also known as split tests, which are online experiments used to test potential improvements to a website or mobile application. Two versions of the website are shown to different users – usually the existing website and a potential change. Then, the results are analyzed to determine whether the change is an improvement worth launching. This course will cover how to choose and characterize metrics to evaluate your experiments, how to design an experiment with enough statistical power, how to analyze the results and draw valid conclusions, and how to ensure that the the participants of your experiments are adequately protected.\n\n\nAdvanced Statistics(Saylor)\nWelcome to the amazing world of statistics! You might be thinking that the topic is just about a bunch of charts, graphs, and odd-looking formulas, but in fact, it is a fascinating and challenging field of study. In this course, we will indeed study those charts and graphs, and yes, that array of complex formulas. But beyond those tools, we will find an entire new way of thinking, a new way of approaching and understanding the world around us. We will learn why taking aspirin helps lower the risk and severity of a heart attack; how researchers have determined that the more friends you have on a social networking site, the more likely you are to have fewer friends in real life; and how political pollsters almost always know the outcome of an election even before the polls open. The course is divided into 10 units of study. The first two units are devoted to simple statistical calculations and graphical representations of data. Most of this material will be familiar to you from previous math or science courses. Unit 3 is devoted to a foundational concept of statistics, which is the study of probability. Unit 4 will introduce you to random variables and a very important distribution called the binomial distribution. Unit 5 will focus entirely on one topic: the bell curve. You may have studied the bell curve, also called the normal distribution, in other courses, but this unit will make sure that you are confident and competent in knowing its properties, its uses, and its central importance to all of the material in the rest of the course and in the entire field of statistics. The first five units build the foundation of concepts, vocabulary, knowledge, and skills for success in the remainder of the course. In the final five units, we will take the plunge into the domain of inferential statistics, where we make statistical decisions based on the data that we have collected. In Unit 6, we will learn how to design statistically sound experiments and studies, in order to collect valid, reliable data. In Unit 7 and Unit 8, we will learn how to analyze the data, using confidence intervals and hypothesis tests, to make statistically sound decisions and inferences about our results. The final two units will be devoted to two topics frequently used in statistical research: linear regression and chi-square analysis. These exotic-sounding topics will act as springboards for your further study of the discipline in your college undergraduate or graduate programs. We will use a variety of resources in addition to the text. An online course needs to be multidimensional so that you won’t be lulled into a daily grind of textbook reading and doing homework problems. In light of this, you will supplement your course text with video lessons, interactive applets, and research into some of statistics’ most interesting, controversial, and fascinating experiments and studies. By the end of the course, you will have mastered the foundational concepts of a field of endeavor that will assist you in studying and understanding the world around you as never before.\n\n\nAlgorithms(Saylor)\nThis course focuses on the fundamentals of computer algorithms, emphasizing methods useful in practice. We look into the algorithm analysis as a way to understand behavior of computer programs as a function of its input size. Using the big-O notation, we classify algorithms by their efficiency. We look into basic algorithm strategies and approaches to problem solving. Some of these approaches include the divide and conquer method, dynamic programming, and greedy programming paradigms. Sorting and searching algorithms are discussed in detail as they form part of a solution to a large number of problems solved using computers. We also provide an introduction to the graph theory and graph algorithms as they are also used in many computer-based applications today. We conclude the course with a look into a special class of problems called the NP-complete problems.\n\n\nAn Introduction to Interactive Programming in Python(Coursera)\nThis course is designed to be a fun introduction to the basics of programming in Python. Our main focus will be on building simple interactive games such as Pong, Blackjack and Asteroids.\n\n\nAn Introduction to Interactive Programming in Python (Part 1)(Coursera)\nThis two-part course is designed to help students with very little or no computing background learn the basics of building simple interactive applications. Our language of choice, Python, is an easy-to learn, high-level computer language that is used in many of the computational courses offered on Coursera. To make learning Python easy, we have developed a new browser-based programming environment that makes developing interactive applications in Python simple. These applications will involve windows whose contents are graphical and respond to buttons, the keyboard and the mouse. The primary method for learning the course material will be to work through multiple ‘mini-projects’ in Python. To make this class enjoyable, these projects will include building fun games such as Pong, Blackjack, and Asteroids. When you’ve finished our course, we can’t promise that you will be a professional programmer, but we think that you will learn a lot about programming in Python and have fun while you’re doing it.\n\n\nAn Introduction to Interactive Programming in Python (Part 2)(Coursera)\nThis two-part course is designed to help students with very little or no computing background learn the basics of building simple interactive applications. Our language of choice, Python, is an easy-to learn, high-level computer language that is used in many of the computational courses offered on Coursera. To make learning Python easy, we have developed a new browser-based programming environment that makes developing interactive applications in Python simple. These applications will involve windows whose contents are graphical and respond to buttons, the keyboard and the mouse. The primary method for learning the course material will be to work through multiple ‘mini-projects’ in Python. To make this class enjoyable, these projects will include building fun games such as Pong, Blackjack, and Asteroids. When you’ve finished our course, we can’t promise that you will be a professional programmer, but we think that you will learn a lot about programming in Python and have fun while you’re doing it.\n\n\nApplied Logistic Regression(Coursera)\nThis Applied Logistic Regression course provides theoretical and practical training for epidemiologists, biostatisticians and professionals of related disciplines in statistical modeling with particular emphasis on logistic regression. The increasingly popular logistic regression model has become the standard method for regression analysis of binary response data in the health sciences. By the end of this course, students should\n• Master methods of statistical modeling when the response variable is binary.\n• Be confident users of the Stata package for computing binary logistic regression models.\nThis is a hands-on, applied course where students will become proficient at using computer software to analyze data drawn primarily from the fields of medicine, epidemiology and public health. There will be many practical examples and homework exercises in this class to help you learn. If you fully apply yourself in this course and complete all of the homework, you will have the opportunity to master various methods of statistical modeling and you will become a more confident user of the Stata* package for computing linear, polynomial and multiple regression.\n\n\nArtificial Intelligence(Saylor)\nCS405 introduces the field of artificial intelligence (AI).  Materials on AI programming, logic, search, game playing, machine learning, natural language understanding, and robotics introduce the student to AI methods, tools, and techniques, their application to computational problems, and their contribution to understanding intelligence.  Because each of these topics could be a course unto itself, the material is introductory and not complete.  Each unit presents the problem a topic addresses, current progress, and approaches to the problem.  The readings include and cite more materials that are referenced in this course, and students are encouraged to use these resources to pursue topics of interest after this course.\n\n\nArtificial Intelligence Planning(Coursera)\nThe course aims to provide a foundation in artificial intelligence techniques for planning, with an overview of the wide spectrum of different problems and approaches, including their underlying theory and their applications.\n\n\n\nB\n\n\n\nBasics of Machine Learning(Datacamp)\nNaive Bayes, decision trees, zero-frequency, missing data, ID3 algorithm, information gain, overfitting, confidence intervals, nearest-neighbour method, Parzen windows, K-D trees, K-means, scree plot, gaussian mixtures, EM algorithm, dimensionality reduction, principal components, eigen-faces, agglomerative clustering, single-link vs. complete link, lance-williams algorithm\n\n\nBig Data Analysis with Revolution R Enterprise(Datacamp)\nRevolution R Enterprise allows R users to process, visualize, and model terabyte-class data sets at a fraction of the time of legacy products without requiring expensive or specialized hardware. Introductory course for accomplished R users to experience the functionality of Revolution R Enterprise.\n\n\nBig Data in Education(Coursera)\nThe emerging research communities in educational data mining and learning analytics are developing methods for mining and modeling the increasing amounts of fine-grained data becoming available about learners. In this class, you will learn about these methods, and their strengths and weaknesses for different applications. You will learn how to use each method to answer education research questions and to drive intervention and improvement in educational software and systems. Methods will be covered both at a theoretical level, and in terms of how to apply and execute them using standard software tools. Issues of validity and generalizability will also be covered, towards learning to establish how trustworthy and applicable the results of an analysis are.\n\n\n\nC\n\n\n\nCarnegie Mellon University\nMachine Learning Videos\n\n\nCluster Analysis in Data Mining(Coursera)\nDiscover the basic concepts of cluster analysis, and then study a set of typical clustering methodologies, algorithms, and applications. This includes partitioning methods such as k-means, hierarchical methods such as BIRCH, density-based methods such as DBSCAN\/OPTICS, probabilistic models, and the EM algorithm. Learn clustering and methods for clustering high dimensional data, streaming data, graph data, and networked data. Explore concepts and methods for constraint-based clustering and semi-supervised clustering. Finally, see examples of cluster analysis in applications.\n\n\nComputational Methods for Data Analysis(Coursera)\nExploratory and objective data analysis methods applied to the physical, engineering, and biological sciences.\n\n\nComputational Statistics in Python\nA Tutorial\n\n\nComputing for Data Analysis(Coursera)\nThis course is about learning the fundamental computing skills necessary for effective data analysis. You will learn to program in R and to use R for reading data, writing functions, making informative graphs, and applying modern statistical methods.\n\n\nCore Concepts in Data Analysis(Coursera)\nLearn both theory and application for basic methods that have been invented either for developing new concepts – principal components or clusters, or for finding interesting correlations – regression and classification. This is preceded by a thorough analysis of 1D and 2D data.\n\n\n\nD\n\n\n\nData Analysis(Coursera)\nLearn about the most effective data analysis methods to solve problems and achieve insight.\n\n\nData Analysis and Statistical Inference(Coursera)\nThis course introduces you to the discipline of statistics as a science of understanding and analyzing data. You will learn how to effectively make use of data in the face of uncertainty: how to collect data, how to analyze data, and how to use data to make inferences and conclusions about real world phenomena.\n\n\nData Analysis and Statistical Inference(Datacamp)\nIn this course you are introduced to the discipline of statistics as a science of understanding and analyzing data. You will learn how to effectively make use of data in the face of uncertainty: how to collect data, how to analyze data, and how to use data to make inferences and conclusions about real world phenomena.\n\n\nData Analysis and Statistical Inference(Datacamp)\nThis interactive DataCamp course complements the Coursera course Data Analysis and Statistical Inference by Mine Çetinkaya-Rundel. For every lesson given at Coursera, you can follow interactive exercises in the comfort of your browser to master the different topics.\n\n\nData Analysis in R, the data.table Way(Datacamp)\nThe data.table package is rapidly making its name as the number one choice for handeling large datasets in R. This course will bring you from data.table novice to data.table expert.\n\n\nData Analysis Learning Path\nThe Data Analysis learning path provides a short but intensive introduction to the field of data analysis. The path is divided into three parts. In part 1, we learn general programming practices (software design, version control) and tools (python, sql, unix, and Git). In part 2, we learn R and focus more narrowly on data analysis, studying statistical techniques, machine learning, and presentation of findings. Part 3 includes a choice of elective topics: visualization, social network analysis, and big data (Hadoop and MapReduce). Choose from any or all of them to enrich your",
                "fallback": "Data Analytics &amp; R Link: Courses",
                "from_url": "http:\/\/advanceddataanalytics.net\/courses\/",
                "id": 1
            }
        ]
    },
    {
        "type": "message",
        "text": "опять в ленте ссылка всплыла (уже была, но мало ли) <http:\/\/videolectures.net\/deeplearning2015_montreal\/>",
        "user": "U0AJU5AMA",
        "ts": "1443385002.000110",
        "team": "T040HKJE3",
        "user_team": "T040HKJE3",
        "source_team": "T040HKJE3",
        "user_profile": {
            "avatar_hash": "gbb21f67d330",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/f6bb21f67d330be3c32e584dfaa9d021.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0013-72.png",
            "first_name": "Jin",
            "real_name": "Jin Kolesnikov",
            "display_name": "jinkolesnikov",
            "team": "T040HKJE3",
            "name": "jinkolesnikov",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "text": "Deep neural networks that learn to represent data in multiple layers of increasing abstraction have dramatically improved the state-of-the-art for speech recognition, object recognition, object detection, predicting the activity of drug molecules, and many other tasks. Deep learning discovers intricate structure in large datasets by building distributed representations, either via supervised, unsupervised or reinforcement learning. The Deep Learning Summer School 2015 is aimed at graduate students and industrial engineers and researchers who already have some basic knowledge of machine learning (and possibly but not necessarily of deep learning) and wish to learn more about this rapidly growing field of research.",
                "fallback": "Deep neural networks that learn to represent data in multiple layers of increasing abstraction have dramatically improved the state-of-the-art for speech recognition, object recognition, object detection, predicting the activity of drug molecules, and many other tasks. Deep learning discovers intricate structure in large datasets by building distributed representations, either via supervised, unsupervised or reinforcement learning. The Deep Learning Summer School 2015 is aimed at graduate students and industrial engineers and researchers who already have some basic knowledge of machine learning (and possibly but not necessarily of deep learning) and wish to learn more about this rapidly growing field of research.",
                "image_url": "http:\/\/hydro.ijs.si\/v011\/9b\/toyix7li62rfa2mjucmaiww2mogesctp.jpg",
                "from_url": "http:\/\/videolectures.net\/deeplearning2015_montreal\/",
                "image_width": 312,
                "image_height": 75,
                "image_bytes": 68620,
                "id": 1
            }
        ]
    }
]