[
    {
        "type": "message",
        "text": "26го числа стартует <https:\/\/www.coursera.org\/learn\/introduction-machine-learning>",
        "user": "U0DJEEXE1",
        "ts": "1452695798.000156",
        "team": "T040HKJE3",
        "user_team": "T040HKJE3",
        "source_team": "T040HKJE3",
        "user_profile": {
            "avatar_hash": "2b518c25d820",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-01-07\/125252632279_2b518c25d820634753aa_72.png",
            "first_name": "max",
            "real_name": "max ivanov",
            "display_name": "lotek93",
            "team": "T040HKJE3",
            "name": "lotek93",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "service_name": "Coursera",
                "title": "Введение в машинное обучение - Higher School of Economics | Coursera",
                "title_link": "https:\/\/www.coursera.org\/learn\/introduction-machine-learning",
                "text": "Введение в машинное обучение from Higher School of Economics. Не так давно получил распространение термин «большие данные», обозначивший новую прикладную область — поиск способов автоматического быстрого анализа огромных объёмов разнородной информации. Наука о больших данных ещё только оформляется, но уже сейчас она очень востребована — и в будущем будет востребована только больше. С её помощью можно решать невероятные задачи: оценивать состояние печени по кардиограмме, предсказывать зарплату по описанию вакансии, предлагать пользователю музыку на основании его анкеты в интернете. Большими данными может оказаться что угодно: результаты научных экспериментов, логи банковских транзакций, метеорологические наблюдения, профили в социальных сетях — словом, всё, что может быть полезно проанализировать. Самым перспективным подходом к анализу больших данных считается применение машинного обучения — набора методов, благодаря которым компьютер может находить в массивах изначально неизвестные взаимосвязи и закономерности. На факультете компьютерных наук ВШЭ и в Школе анализа данных есть люди, активно использующие машинное обучение и разрабатывающие новые подходы к нему. Именно они — преподаватели этого курса. Вы изучите основные типы задач, решаемых с помощью машинного обучения — в основном речь пойдёт о классификации, регрессии и кластеризации. Узнаете об основных методах машинного обучения и их особенностях, научитесь оценивать качество моделей — и решать, подходит ли модель для решения конкретной задачи. Наконец, познакомитесь с современными библиотеками, в которых реализованы обсуждаемые модели и методы оценки их качества. Для работы мы будем использовать реальные данные из реальных задач. Краткая программа курса: Неделя 1. Введение. Примеры задач. Логические методы: решающие деревья и решающие леса. Неделя 2. Метрические методы классификации. Линейные методы, стохастический градиент. Неделя 3. Метод опорных векторов (SVM). Логистическая регрессия. Метрики качества классификации. Неделя 4. Линейная регрессия. Понижение размерности, метод главных компонент. Неделя 5. Композиции алгоритмов, градиентный бустинг. Нейронные сети. Неделя 6. Кластеризация и визуализация. Частичное обучение. Неделя 7. Прикладные задачи анализа данных: постановки и методы решения. Участнику курса нужно владеть основными конструкциями из математики, такими как функции, производные, вектора, матрицы. Для выполнения практических заданий потребуются базовые навыки программирования. Знание языка Python желательно, но не обязательно. Для успешного окончания курса потребуется набрать проходное число баллов за оцениваемые тесты и практические задания, а также выполнить финальный проект, посвященный решению прикладной задачи анализа данных. Мы уверены, что этот курс будет полезен каждому, кто хочет постичь искусство предсказательного моделирования и освоить интеллектуальный анализ данных. Take free online classes from 120+ top universities and educational organizations. We partner with schools like Stanford, Yale, Princeton, and others to offer courses in dozens of topics, from computer science to teaching and beyond. Whether you are pursuing a passion or looking to advance your career, Coursera provides open, free education for everyone.",
                "fallback": "Coursera: Введение в машинное обучение - Higher School of Economics | Coursera",
                "thumb_url": "https:\/\/coursera-course-photos.s3.amazonaws.com\/a2\/c23430579811e59644373576122c07\/Ya-Icon-new-size.jpg",
                "from_url": "https:\/\/www.coursera.org\/learn\/introduction-machine-learning",
                "thumb_width": 1200,
                "thumb_height": 1200,
                "id": 1
            }
        ]
    }
]