[
    {
        "type": "message",
        "text": "Привет, посоветуйте пожалуйста что-нибудь совсем базовое по ML для новичка, Курс какой-нибудь, кроме <https:\/\/www.coursera.org\/learn\/vvedenie-mashinnoe-obuchenie>",
        "user": "U2VSSCLUX",
        "ts": "1477866490.001787",
        "team": "T040HKJE3",
        "user_team": "T040HKJE3",
        "source_team": "T040HKJE3",
        "user_profile": {
            "avatar_hash": "ge21aedb413e",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/25e21aedb413eb22b0ca53760d090c62.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0007-72.png",
            "first_name": "Max",
            "real_name": "Max Filippov",
            "display_name": "mfilippov",
            "team": "T040HKJE3",
            "name": "mfilippov",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "service_name": "Coursera",
                "title": "Введение в машинное обучение - Higher School of Economics | Coursera",
                "title_link": "https:\/\/www.coursera.org\/learn\/vvedenie-mashinnoe-obuchenie",
                "text": "Введение в машинное обучение from Higher School of Economics. Не так давно получил распространение термин «большие данные», обозначивший новую прикладную область — поиск способов автоматического быстрого анализа огромных объёмов разнородной информации. Наука о больших данных ещё только оформляется, но уже сейчас она очень востребована — и в будущем будет востребована только больше. С её помощью можно решать невероятные задачи: оценивать состояние печени по кардиограмме, предсказывать зарплату по описанию вакансии, предлагать пользователю музыку на основании его анкеты в интернете. Большими данными может оказаться что угодно: результаты научных экспериментов, логи банковских транзакций, метеорологические наблюдения, профили в социальных сетях — словом, всё, что может быть полезно проанализировать. Самым перспективным подходом к анализу больших данных считается применение машинного обучения — набора методов, благодаря которым компьютер может находить в массивах изначально неизвестные взаимосвязи и закономерности. На факультете компьютерных наук ВШЭ и в Школе анализа данных есть люди, активно использующие машинное обучение и разрабатывающие новые подходы к нему. Именно они — преподаватели этого курса. Вы изучите основные типы задач, решаемых с помощью машинного обучения — в основном речь пойдёт о классификации, регрессии и кластеризации. Узнаете об основных методах машинного обучения и их особенностях, научитесь оценивать качество моделей — и решать, подходит ли модель для решения конкретной задачи. Наконец, познакомитесь с современными библиотеками, в которых реализованы обсуждаемые модели и методы оценки их качества. Для работы мы будем использовать реальные данные из реальных задач. Краткая программа курса: Неделя 1. Введение. Примеры задач. Логические методы: решающие деревья и решающие леса. Неделя 2. Метрические методы классификации. Линейные методы, стохастический градиент. Неделя 3. Метод опорных векторов (SVM). Логистическая регрессия. Метрики качества классификации. Неделя 4. Линейная регрессия. Понижение размерности, метод главных компонент. Неделя 5. Композиции алгоритмов, градиентный бустинг. Нейронные сети. Неделя 6. Кластеризация и визуализация. Частичное обучение. Неделя 7. Прикладные задачи анализа данных: постановки и методы решения. Слушателю нужно знать об основных понятиях математики: функциях, производных, векторах, матрицах. Для выполнения практических заданий потребуются базовые навыки программирования. Очень желательно знать Python. Задания рассчитаны на использование этого языка и его библиотек numpy, pandas и scikit-learn. Чтобы успешно завершить курс, нужно набрать проходную сумму баллов за тесты и практические задания, а также выполнить финальный проект, посвящённый решению прикладной задачи анализа данных. Мы уверены, что этот курс будет полезен каждому, кто хочет постичь искусство предсказательного моделирования и освоить интеллектуальный анализ данных. 1000+ courses from schools like Stanford and Yale - no application required. Build career skills in data science, computer science, business, and more.",
                "fallback": "Coursera: Введение в машинное обучение - Higher School of Economics | Coursera",
                "thumb_url": "https:\/\/d3njjcbhbojbot.cloudfront.net\/api\/utilities\/v1\/imageproxy\/https:\/\/coursera-course-photos.s3.amazonaws.com\/a2\/c23430579811e59644373576122c07\/Ya-Icon-new-size.jpg",
                "from_url": "https:\/\/www.coursera.org\/learn\/vvedenie-mashinnoe-obuchenie",
                "thumb_width": 1200,
                "thumb_height": 1200,
                "service_icon": "https:\/\/d3njjcbhbojbot.cloudfront.net\/web\/images\/favicons\/apple-touch-icon-57x57.png",
                "id": 1
            }
        ]
    },
    {
        "type": "message",
        "text": "<@U2VSSCLUX> есть специализация от МФТИ <https:\/\/www.coursera.org\/specializations\/machine-learning-data-analysis>",
        "user": "U2F68DB26",
        "ts": "1477867309.001789",
        "team": "T040HKJE3",
        "user_team": "T040HKJE3",
        "source_team": "T040HKJE3",
        "user_profile": {
            "avatar_hash": "g5023337790b",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/9f5023337790b2c05d36c516d43974dc.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0014-72.png",
            "first_name": "Dmitry",
            "real_name": "Dmitry Kryuchkov",
            "display_name": "xelibrion",
            "team": "T040HKJE3",
            "name": "xelibrion",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "service_name": "Coursera",
                "title": "Машинное обучение и анализ данных | Coursera",
                "title_link": "https:\/\/www.coursera.org\/specializations\/machine-learning-data-analysis",
                "text": "Explore Машинное обучение и анализ данных Certificate offered by Moscow Institute of Physics and Technology. Машинное обучение и анализ данных - Освойте науку о данных и научитесь решать с помощью ее методов прикладные задачи. Вы знакомы с таким понятием, как большой массив данных? Сделайте следующий шаг – станьте профессионалом в этой области, пройдя специализацию «Машинное обучение и анализ данных»! Мы покажем, как проходит полный цикл анализа, от сбора данных до выбора оптимального решения и оценки его качества. Вы научитесь пользоваться современными аналитическими инструментами и адаптировать их под особенности конкретных задач. Таким образом, каждый курс в рамках специализации включает в себя как теорию, так и практические задания различного уровня сложности. В рамках специализации вы освоите основные темы, необходимые в работе с большим массивом данных, в т.ч. современные методы классификации и регрессии, поиск структуры в данных, проведение экспериментов, построение выводов, базовая фундаментальная математика, основы программирования на Python. В центре внимания — типовые задачи машинного обучения и анализа данных. Мы разберём, как построить рекомендательную систему, оценить эмоциональную окраску текста, спрогнозировать спрос на товар, оценить вероятность клика по рекламе и т.д. В финале вам потребуется выполнить проект собственной системы, решающей любую актуальную для бизнеса задачу. Результатом будет наглядная работающая модель, которую вы сможете использовать в вашей повседневной работе или продемонстрировать на собеседовании. Прохождение специализации поможет вам стать специалистом в одной из самых востребованных и активно развивающихся научных областей! 1000+ courses from schools like Stanford and Yale - no application required. Build career skills in data science, computer science, business, and more.",
                "fallback": "Coursera: Машинное обучение и анализ данных | Coursera",
                "thumb_url": "https:\/\/d15cw65ipctsrr.cloudfront.net\/f7\/498c60b18411e5965623dd71776f15\/yandex-spec-logo.png",
                "from_url": "https:\/\/www.coursera.org\/specializations\/machine-learning-data-analysis",
                "thumb_width": 600,
                "thumb_height": 600,
                "service_icon": "https:\/\/d3njjcbhbojbot.cloudfront.net\/web\/images\/favicons\/apple-touch-icon-57x57.png",
                "id": 1
            }
        ]
    },
    {
        "type": "message",
        "text": "Спасибо!",
        "user": "U2VSSCLUX",
        "ts": "1477867414.001791",
        "team": "T040HKJE3",
        "user_team": "T040HKJE3",
        "source_team": "T040HKJE3",
        "user_profile": {
            "avatar_hash": "ge21aedb413e",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/25e21aedb413eb22b0ca53760d090c62.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0007-72.png",
            "first_name": "Max",
            "real_name": "Max Filippov",
            "display_name": "mfilippov",
            "team": "T040HKJE3",
            "name": "mfilippov",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "хотя на самом деле написано что сложность intermediate",
        "user": "U2F68DB26",
        "ts": "1477867544.001792",
        "team": "T040HKJE3",
        "user_team": "T040HKJE3",
        "source_team": "T040HKJE3",
        "user_profile": {
            "avatar_hash": "g5023337790b",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/9f5023337790b2c05d36c516d43974dc.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0014-72.png",
            "first_name": "Dmitry",
            "real_name": "Dmitry Kryuchkov",
            "display_name": "xelibrion",
            "team": "T040HKJE3",
            "name": "xelibrion",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "Да не, там достаточно постепенно вводят. Хотя, новичку придется местами попотеть. Но для этого форум и менторы есть, чтобы их попытать.",
        "user": "U15UZGX9A",
        "ts": "1477895568.001793",
        "team": "T040HKJE3",
        "user_team": "T040HKJE3",
        "source_team": "T040HKJE3",
        "user_profile": {
            "avatar_hash": "0cf1ac209f77",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-07-02\/206884088562_0cf1ac209f7716856af6_72.jpg",
            "first_name": "Artem",
            "real_name": "Artem Erokhin",
            "display_name": "gofat",
            "team": "T040HKJE3",
            "name": "gofat",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    }
]